# 중복 데이터 처러

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                  'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})

In [5]:
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [8]:
# 중복데이터 확인 -> duplicated() 메소드 사용 => boolean 중복시 True
df_dup = df.duplicated()
df_dup

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [9]:
col_dup = df['c2'].duplicated()
col_dup

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

In [ ]:
# 중복데이터 제거 -> drop_duplicates() 메소드 => 중복되는 행을 제거함

In [12]:
df2= df.drop_duplicates()
df2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [13]:
# 특정 열 기준 중복 행 제거 -> subset 옵션
df3= df.drop_duplicates(subset=['c2','c3'])
df3

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2